{
    "AR/VR":[
        {
            "Title":"AR Brick Breaker Game",
            "Description":"This was my first project done in Unity, which is a marker based augmented reality game, where the player uses the marker to play the game and break the bricks. Vuforia images targets and camera were used in this project",
            "ProjectLink":["https://github.com/nayaaltahan/mix1-assignment1"],
            "VideoLink": "https://youtu.be/wFPTo9W-S78"
        },
        {
            "Title":"Guided Virtual Travel in AR",
            "Description":"Since the pandemic was preventing people from travelling, we decided to create an AR application that will offer the user a guided ( audio guide or text of the places' names ) tour of Paris and London. We built the app so it can be easily extended to tour around more cities. The application was built in Unity and it uses Google ARCore",
            "ProjectLink":["https://github.com/nayaaltahan/mix1-assignment22"],
            "VideoLink": "https://youtu.be/LbZpk2n9XHo"
        },
        {
            "Title":"Beat Saber Recreation",
            "Description":"This is a quick recreation of the VR game, Beat Saber. It's built in Unity for Oculus Quest using the Oculus Integration Package.",
            "ProjectLink":["https://github.com/nayaaltahan/mix1-assignment33"],
            "VideoLink": "https://youtu.be/Zua3fIU46_o"
        },
        {
            "Title":"VR Escape Room",
            "Description":"Escape room targeted for smaller kids, where they solve some mysteries to find the key and win the game. The game contains 4 steps to complete, and itøs in VR. It's built in Unity for Oculus Quest using the Oculus Integration Package.",
            "ProjectLink":["https://github.com/nayaaltahan/mix1-assignment4"],
            "VideoLink": "https://youtu.be/LMlsVQx5Be0"
        }
    ],
    "Websites": [
        {
            "Title":"Website for Bed and Breakfast",
            "Description":"When I first learned about ASP.NET and how to create a web appliaction using it, I decided to create this little website for a bed and breakfast, I used ASP.NET MVC which makes the architecture of the application very effiecent and easy to understand",
            "ProjectLinks":["https://github.com/nayaaltahan/rytterskolens_bb_website"],
            "VideoLink": "https://youtu.be/PNWBnJ9CqzI"
        },
        {
            "Title":"Flights Tracker Website",
            "Description":"ASP.NET MVC based web application, that uses Chart.JS to display charts of flights related data. The project is hosted on the cloud using AWS",
            "ProjectLinks":["https://github.com/nayaaltahan/SEP6_backend","https://github.com/nayaaltahan/SEP6_frontend"],
            "VideoLink": "https://youtu.be/dD1VZekg7y8"
        }
    ],
    "MobileApplications": [
        {
            "Title":"Dothraki Translator",
            "Description":"I created this application to translate english words and phrases to Dothraki, a Games of Thrones language. The application is programmed in Java and runs on Android phones. THe appliaction translates, saves translation history, and has a share functionality",
            "ProjectLink":["https://github.com/nayaaltahan/GOT_Dothraki-English_Translator"],
            "VideoLink": "https://youtu.be/XHHHlnzu6Qk"
        },
        {
            "Title":"Plant Management Application",
            "Description":"An application that tracks plants using a sensors device. the device tracks light, humidity, temperature and CO2 levels to make sure its within the limits that the end-user has specified. The user can view the plant data and the data will show in red in case it's not within the limits. The application keeps the data stored in a database and gets it through an API built in Java. The Data has a datawarehouse that can be viewed though PowerBI, I was responsible of the backend and data warehousing parts of the project",
            "ProjectLink":["https://github.com/nayaaltahan/DB_SEP4_PMI", "https://github.com/mungiu/SEP4_PMI"],
            "VideoLink": "https://youtu.be/AjJiwaHSCUU"
        }
    ]
}